In [1]:
import pandas as pd

In [16]:
netflix = pd.read_csv("data/movie_titles.tsv", sep='\t')
houses = pd.read_csv("data/kc_house_data.csv")
titanic = pd.read_csv("data/titanic.csv")

In [11]:
netflix.loc[17:20]

     m0 10 things i hate about you  1999  6.90     62847  ['comedy' 'romance']
17  m18           american madness  1932   7.4     702.0             ['drama']
18  m19           american outlaws  2001   5.7    7425.0  ['action' 'western']
19  m20            american psycho  2000   7.4  101357.0  ['drama' 'thriller']
20  m21                  antitrust  2001   6.0   16453.0  ['drama' 'thriller']

In [22]:
df = titanic.head()

In [23]:
df.sex

0    female
1      male
2    female
3      male
4    female
Name: sex, dtype: object

In [24]:
df.sex == 'female'

0     True
1    False
2     True
3    False
4     True
Name: sex, dtype: bool

In [25]:
df[df.sex=='female']

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29,0,0,24160,211.3375,B5,S,2,?,"St Louis, MO"
2,1,0,"Allison, Miss. Helen Loraine",female,2,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"

In [26]:
df['survived'] == 0

0    False
1    False
2     True
3     True
4     True
Name: survived, dtype: bool

In [27]:
df[df['survived'] == 0]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
2,1,0,"Allison, Miss. Helen Loraine",female,2,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30,1,2,113781,151.55,C22 C26,S,?,135,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"

In [29]:
bools = [False, False, True, True, True]
df[bools]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
2,1,0,"Allison, Miss. Helen Loraine",female,2,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30,1,2,113781,151.55,C22 C26,S,?,135,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"